Repository: autohotkey-docs-translation/v2-ja
Catalog: omegat/project_save.tmx
Source language: en
Languages: ja

source: Any instance of Object or a derived class can be a base object, but an object can only be assigned as the base of an object with the same native type.
ja: Objectのインスタンスや派生クラスはすべてベース・オブジェクトになることができるが、オブジェクトは同じネイティブ・タイプを持つオブジェクトのベースとしてのみ割り当てることができる。

source: Any integer constants outside this range wrap around.
ja: この範囲外の整数定数はラップアラウンドする。

source: Any items previously at or to the right of Index are shifted to the right.
ja: これまでIndexの右側にあったアイテムは、右側に移動します。

source: Any keystrokes which cause text to be appended to the Input buffer are counted as producing text, even if they do not normally do so in other applications.
ja: 入力バッファにテキストが追加されるようなキー操作は、他のアプリケーションでは通常そうでなくても、テキストを生成したものとしてカウントされます。

source: Any matching folders will also be changed due to the last parameter.
ja: 一致するフォルダーは、最後のパラメーターによって変更されます。

source: Any missing dot-delimited components are assumed to be zero.
ja: ドット区切りの成分が欠落している場合は、ゼロとします。

source: Any modifications which are made to the menu directly by Win32 functions are not reflected by the script's Menu object, so may be lost if an item is modified by one of the built-in methods.
ja: Win32の関数で直接メニューに加えられた修正は、スクリプトのMenuオブジェクトには反映されないので、ビルトインメソッドでアイテムが修正されると、失われる可能性があります。

source: Any nested function which does not capture variables is automatically static; that is, every call to the outer function references the same Func.
ja: つまり、外側の関数を呼び出すたびに、同じFuncを参照することになります。

source: Any number of InputHook objects can be created and in progress at any time, but the order in which they are started affects how input is collected.
ja: InputHookオブジェクトは、いつでもいくつでも作成でき、進行中ですが、開始する順番によって、入力の収集方法に影響があります。

source: Any number of OnExit functions can be registered.
ja: OnExitの機能はいくつでも登録可能です。

source: Any number of functions or function objects can monitor a given MsgNumber.
ja: 任意の数の関数または関数オブジェクトが、与えられたMsgNumberを監視することができます。

source: Any number of parameters.
ja: パラメータの数は問いません。

source: Any number of variables, properties or array elements may refer to the same object.
ja: 変数、プロパティ、配列の要素は、いくつでも同じオブジェクトを参照することができます。

source: Any number of windows can be reduced in this fashion (the script remembers each).
ja: この方法で、いくつでもウィンドウを減らすことができる（スクリプトはそれぞれを記憶している）。

source: Any numeric value, the same as in v1.
ja: 任意の数値、v1 と同じ。

source: Any object can be used as the base of any other object which has the same native type.
ja: どんなオブジェクトでも、同じネイティブ・タイプを持つ他のオブジェクトのベースとして使うことができる。

source: Any object which implements Ptr and Size properties may be used, but this function is optimized for the native Buffer object.
ja: PtrプロパティとSizeプロパティを実装したオブジェクトであれば何でも使用できますが、この関数はネイティブのBufferオブジェクトに最適化されています。

source: Any object which implements Ptr and Size properties may be used.
ja: PtrプロパティとSizeプロパティを実装しているオブジェクトであれば、どのようなものでも使用可能です。

source: Any object with Ptr and Size properties can be passed to NumPut, NumGet, StrPut, StrGet, File.RawRead, File.RawWrite and FileAppend.
ja: PtrとSizeプロパティを持つオブジェクトは、NumPut、NumGet、StrPut、StrGet、File.RawRead、File.RawWrite、FileAppendに渡すことができます。

source: Any object with a Ptr property can be passed to DllCall parameters with Ptr type, SendMessage and PostMessage.
ja: Ptrプロパティを持つオブジェクトであれば、Ptr型のDllCallパラメータ、SendMessage、PostMessageに渡すことができます。

source: Any of the output variables may be omitted if the corresponding information is not needed.
ja: 対応する情報が不要な場合は、出力変数のいずれかを省略することができる。

source: Any other command-line parameters passed to the script's current instance are not passed to the new instance.
ja: スクリプトの現在のインスタンスに渡された他のコマンドラインパラメータは、新しいインスタンスに渡されません。

source: Any other IID
ja: その他のIID

source: Any other condition you are able to detect with code.
ja: その他、コードで検出できる状態であれば何でもOKです。

source: Any other invalid keys cause a ValueError to be thrown.
ja: それ以外の無効なキーは、ValueErrorがスローされます。

source: Any other invalid placeholders are included in the result as is.
ja: それ以外の無効なプレースホルダーは、そのまま結果に含まれます。

source: Any other kind of expression to the left of : is illegal.
ja: それ以外の:の左側の表現は不正です。

source: Any other object which can be called like a function, such as a BoundFunc object or a JavaScript function object returned by a COM method.
ja: BoundFuncオブジェクトやCOMメソッドが返すJavaScript関数オブジェクトなど、関数のように呼び出すことができるその他のオブジェクト。

source: Any other parameters passed by the caller are appended to the parameter list.
ja: 呼び出し元から渡された他のパラメータは、パラメータリストに追加されます。

source: Any other resource
ja: その他のリソース

source: Any parameter that contains spaces should be enclosed in quotation marks.
ja: スペースを含むパラメータは引用符で囲む。

source: Any parameters passed to ClassName() are forwarded to __New, so can affect the object's initial content or how it is constructed.
ja: ClassName()に渡されたパラメータはすべて__Newに転送されるため、オブジェクトの初期内容や構築方法に影響を与える可能性があります。

source: Any path contained by the drive (might also work on UNC paths and mapped drives).
ja: ドライブに含まれるすべてのパス（UNCパスやマップされたドライブでも動作する場合があります）。

source: Any popup menu can be shown, including submenus and the tray menu.
ja: サブメニューやトレイメニューなど、あらゆるポップアップメニューを表示することが可能です。

source: Any positive number will turn on the setting (mute) and a zero will turn it off (unmute).
ja: 正数ならオン（ミュート）、ゼロならオフ（ミュート解除）。

source: Any predefined variables which lack this prefix (such as Object) are just global variables.
ja: この接頭辞がない定義済み変数（Objectなど）は、単なるグローバル変数です。

source: Any predefined/built-in method.
ja: 任意の定義済み/組み込みの方法。

source: Any property created by a method definition within a class.
ja: クラス内のメソッド定義によって作成されるすべてのプロパティ。

source: Any property created by passing a descriptor like {Call:
ja: 記述子を渡すことで作成されるプロパティ、以下のような{Call:

source: Any property created by passing a descriptor like {Call: fn} to DefineProp, where fn implements the method.
ja: 記述子を渡すことで作成されるプロパティ、以下のような{Call: fn} からDefinePropへ、fnはメソッドを実装しています。

source: Any represents the root of the AutoHotkey type hierarchy.
ja: Anyは、AutoHotkeyのタイプ階層のルートを表します。

source: Any result indicating failure causes an OSError to be thrown; therefore, the return type must not be omitted unless the actual return type is HRESULT.
ja: 失敗を示す結果は、OSErrorが投げられる。したがって、実際の戻り値の型が HRESULT である場合を除き、戻り値の型を省略してはならない。

source: Any rows at or beneath RowNumber are shifted downward to make room for the new row.
ja: RowNumber以下の行は、新しい行のためのスペースを確保するために下方にシフトされます。

source: Any script which uses this function must be aware what type of value the wrapper object contains and how it should be treated.
ja: この関数を使用するスクリプトは、ラッパー・オブジェクトがどのようなタイプの値を含み、どのように扱われるべきかを認識していなければなりません。

source: Any single character or one of the key names from the key list.
ja: 任意の1文字、またはキーリストのキー名の1つを指定します。

source: Any single key.
ja: 任意の1つのキーです。

source: Any standard items already in the menu are not duplicated, but any missing items are added.
ja: すでにある標準的なメニューは重複せず、足りないものは追加されます。

source: Any string value or variable.
ja: 任意の文字列値または変数。

source: Any sub-expression enclosed in parentheses.
ja: 括弧で囲まれた任意の部分式。

source: Any subsequent window parameters are ignored.
ja: それ以降のウィンドウパラメータは無視されます。

source: Any such detached ImageList should normally be destroyed via IL_Destroy.
ja: このような切り離されたImageListは、通常IL_Destroyで破棄する必要があります。

source: Any such line would never be executed.
ja: そんなセリフがあっても実行されることはない。

source: Any suffix beginning with "+" is ignored.
ja: 「+」で始まる接尾語は無視されます。

source: Any supported image format can be converted to an icon by specifying "Icon1".
ja: "Icon1"を指定することで、対応している画像フォーマットであれば、どのようなものでもアイコンに変換することが可能です。

source: Any syntax errors will be displayed, and they must be corrected before the script can run.
ja: 構文エラーはすべて表示され、スクリプトを実行する前に修正する必要があります。

source: Any system-defined or custom verb.
ja: システムで定義された、またはカスタムされた任意の動詞。

source: Any text associated with this style is displayed in the rectangle's upper left corner.
ja: このスタイルに関連付けられたテキストは、矩形の左上隅に表示されます。

source: Any text between the top and bottom parentheses is treated literally.
ja: 上下の括弧の間のテキストは、文字通りに扱われます。

source: Any text editor can be used to edit an AutoHotkey script, but editors which are (or can be configured to be) more AutoHotkey-aware tend to make reading, editing and testing scripts much easier.
ja: AutoHotkeyスクリプトの編集にはどんなテキストエディタでも使えますが、AutoHotkeyに対応した（または対応するように設定できる）エディタを使うと、スクリプトの読み込み、編集、テストがより簡単になる傾向があります。

source: Any text needs to be in quotes.
ja: テキストは引用符で囲む必要がある。

source: Any text normally produced by this key is ignored, and the key is treated as a non-text key (see VisibleNonText).
ja: このキーによって通常生成されるテキストはすべて無視され、キーは非テキストキーとして扱われる（VisibleNonText参照）。

source: Any thread (hotkey, timed subroutine, custom menu item, etc.) with a priority lower than that of the current thread cannot interrupt it.
ja: 現在のスレッドより優先順位の低いスレッド（ホットキー、時限サブルーチン、カスタムメニュー項目など）は、そのスレッドに割り込むことができない。

source: Any thread may be interrupted in emergencies.
ja: 緊急時にはどのスレッドも中断される可能性がある。

source: Any use of Send may potentially release the modifier permanently, so DownTemp is not ideal for remapping modifier keys.
ja: Sendを使用すると、モディファイアを永久に解放する可能性があるため、DownTempはモディファイアキーの再マッピングに適していません。

source: Any use of built-in variable replacements must only be from group 1 above.
ja: ビルトイン変数の置換は、上記グループ1のものでなければならない。

source: Any valid expression.
ja: 任意の有効な式。

source: Any value to assign to the property.
ja: プロパティに割り当てる任意の値。

source: Any value which is not a primitive value (number or string) is considered to be an object, including those which do not derive from Object, such as COM wrapper objects.
ja: プリミティブな値（数値や文字列）でないものは、COMのラッパーオブジェクトなど、Objectから派生しないものも含めて、オブジェクトとみなされます。

source: Any value with a Call method can be called, so HasMethod(value, "Call") can be used to avoid this error.
ja: Callメソッドを持つ値はすべて呼び出せるので、HasMethod(value, "Call")を使うことでこのエラーを回避できる。

source: Any value, of any type except ComObject.
ja: ComObject 以外の任意の型の値。

source: Any value, of any type.
ja: 任意の値、任意の型。

source: Any variable reference in an assume-local function may resolve to a global variable if it is only read.
ja: 想定ローカル関数内の変数参照は、それが読み込まれるだけであれば、グローバル変数に解決される可能性があります。

source: Any variable references there are said to be global, since they can be accessed by any function (with the proper declaration).
ja: そこで参照される変数は、（適切な宣言があれば）どの関数からもアクセスできるため、グローバル変数と呼ばれる。

source: Any verb registered with the system can be executed by using the * prefix as shown below:
ja: システムに登録されている動詞は、以下のように*接頭辞をつけることで実行することができます：

source: Anything inside of these brackets are OPTIONAL.
ja: これらの括弧の中は オプション.

source: Anything inside of these brackets are optional.
ja: これらの括弧の中はオプション。

source: Anything to the left of :: are the keys you need to press.
ja: ::の左にあるものが、押すべきキーである。

source: Appearance of the font does not matter.
ja: フォントの外観は問いません。

source: Appearance of the font is less important than when the PROOF_QUALITY value is used.
ja: フォントの外観は、PROOF_QUALITY 値を使用する場合よりも重要ではありません。

source: Appearance:
ja: アピアランス（外観）：

source: Append := followed by a literal number, quoted/literal string such as "fox" or "", or an expression that should be evaluated each time the parameter needs to be initialized with its default value.
ja: :=の後に、リテラル数値、"fox"や""などの引用/リテラル文字列、またはパラメータをデフォルト値で初期化する必要がある場合に毎回評価されるべき式を追加します。

source: Append ? or := unset to define a parameter which is unset by default.
ja: デフォルトで設定されていないパラメータを定義する場合は、?または:= unsetを付加します。

source: Append an asterisk (with optional preceding space) to any of the above types to cause the address of the argument to be passed rather than the value itself (the called function must be designed to accept it).
ja: 上記の型のいずれかにアスタリスク（オプションでその前にスペース）を付けると、値そのものではなく、引数のアドレスが渡されます（呼び出された関数は、それを受け入れるように設計されていなければなりません）。

source: Append one or more items using the Push method:
ja: Pushメソッドを使用して、1つまたは複数のアイテムを追加します：

source: Appending to a file in this manner performs better than using FileAppend in its 2-parameter mode because the file does not need to be closed and re-opened for each operation.
ja: この方法は、2パラメータモードのFileAppendを使用するよりも、操作のたびにファイルを閉じて開き直す必要がないため、より優れたパフォーマンスを発揮します。

source: Appends items.
ja: 項目を追加します。

source: Appends list items to a ListBox, DropDownList or ComboBox, or tabs to a Tab control.
ja: ListBox、DropDownList、ComboBoxにはリストアイテムを、Tabコントロールにはタブを追加します。

source: Appends some text to the clipboard.
ja: クリップボードにテキストを追加します。

source: Appends the specified entries at the current list of a ListBox, DropDownList, ComboBox, or Tab control.
ja: ListBox、DropDownList、ComboBox、Tab コントロールの現在のリストに、指定された項目を追加します。

source: Appends values to the end of an array.
ja: 配列の末尾に値を追加します。

source: Applies a condition to the continuation of a Loop or For-loop.
ja: LoopまたはForループの継続に条件を適用します。

source: Applies to:
ja: 適用：

source: Applies to: Button, CheckBox, Radio, DDL, ComboBox, ListBox, ListView, TreeView, Edit, DateTime.
ja: 適用：Button、CheckBox、Radio、DDL、ComboBox、ListBox、ListView、TreeView、Edit、DateTime。

source: Applies to: DDL, ComboBox, ListBox, Edit, DateTime, MonthCal, Hotkey, UpDown, Slider, Tab.
ja: 適用：DDL、ComboBox、ListBox、Edit、DateTime、MonthCal、Hotkey、UpDown、Slider、Tab。

source: Applies to: ListView, TreeView.
ja: 適用：ListView、TreeView。

source: Applies to: ListView.
ja: 適用：ListView。

source: Applies to: Text, Pic, Button, CheckBox, Radio, ComboBox, ListBox, ListView, TreeView, StatusBar.
ja: 適用：Text、Pic、Button、CheckBox、Radio、ComboBox、ListBox、ListView、TreeView、StatusBar。

source: Applies to: Text, Pic, Button, CheckBox, Radio, ListView, TreeView, Link, StatusBar.
ja: 適用：Text、Pic、Button、CheckBox、Radio、ListView、TreeView、Link、StatusBar。

source: Applies to: TreeView.
ja: 適用：TreeView。

source: Applies to: All controls except Edit and MonthCal (and the Edit control within a ComboBox), which have their own standard context menu.
ja: 適用：EditとMonthCal（およびComboBox内のEditコントロール）以外のすべてのコントロールは、独自の標準コンテキストメニューを持っています。

source: Apply *, ?, +, or {min,max} to a series of characters rather than just one.
ja: *、?、+、{min,max}のいずれかをシリーズに適用する。

source: Apply the given WarningMode to all supported warning types.
ja: サポートされているすべての警告タイプに、与えられたWarningModeを適用します。

source: Applying compatibility settings in the AutoHotkey executable or compiled script's properties causes the OS to report a different version number, which is reflected by A_OSVersion.
ja: AutoHotkey実行ファイルまたはコンパイル済みスクリプトのプロパティで互換性設定を適用すると、OSが異なるバージョン番号を報告するようになり、A_OSVersionに反映されます。

source: Applying the +Owner option to a Gui also removes the WS_CHILD style and sets the WS_POPUP style.
ja: また、Guiに+Ownerオプションを適用すると、WS_CHILDスタイルが削除され、WS_POPUPスタイルが設定されます。

source: Aqua
ja: Aqua（水色）

source: Arabic
ja: アラビア語

source: Are you sure...?", click Run.
ja: このソフトウェアを実行しますか？」と表示されたら、［実行(R)］をクリックします。

source: Argument
ja: 引数

source: Argument:
ja: 引数：

source: Arranges a variable's contents in alphabetical, numerical, or random order (optionally removing duplicates).
ja: 変数の内容をアルファベット順、数値順、ランダム順に並べます（オプションで重複を削除します）。

source: Array Object
ja: Arrayオブジェクト

source: Array Object - Methods & Properties | AutoHotkey v2
ja: Arrayオブジェクト - メソッドとプロパティ｜AutoHotkey v2

source: Array and Map have a Capacity property which corresponds to the object's current array or map allocation.
ja: ArrayとMapには、オブジェクトの現在の配列またはマップの割り当てに対応するCapacityプロパティがあります。

source: Array constructor
ja: 配列コンストラクタ

source: Arrays
ja: 配列

source: Arrays are often created by enclosing a list of values in brackets.
ja: 配列は、値のリストを括弧で囲むことで作成されることが多い。

source: Arrays are used wherever a pipe-delimited list was previously used, such as to specify the items for a ListBox when creating it, when adding items, or when retrieving the selected items.
ja: 配列は、リストボックスの作成時、項目の追加時、選択された項目の取得時など、これまでパイプで区切られたリストが使われていた場所に使用されます。

source: Arrays can be constructed with Array(values*) or [values*].
ja: 配列は、Array(values*)または[values*]で構築することができます。

source: Arrays containing up to 8 dimensions are supported.
ja: 最大8次元までの配列に対応しています。

source: Arrays internal to the expression evaluator which were sized based on MAX_TOKENS are now based on precalculated estimates of the required sizes, so performance should be similar but stack usage is somewhat lower in most cases.
ja: MAX_TOKENSに基づいてサイズ設定されていた式評価器内部の配列は、必要なサイズの事前計算に基づいて設定されるようになったため、パフォーマンスはほぼ同じですが、ほとんどの場合、スタック使用量は多少少なくなります。

source: Arrays of Arrays
ja: 配列の配列

source: Arrays with up to 8 dimensions are supported.
ja: 最大8次元までの配列に対応しています。

source: As 64-bit signed integers are used, a positive input value will always give a negative result and vice versa.
ja: 64ビットの符号付き整数を使用するため、正の入力値は常に負の結果を与え、その逆も同様である。

source: As __Get is no longer called if a property is inherited, the following subpattern names can no longer be used with the shorthand syntax:
ja: プロパティが継承されている場合、__Getが呼び出されなくなったため、以下のサブパターン名は省略構文で使用できなくなりました：

source: As __Get is no longer called if a property is inherited, the following subpattern names can no longer be used with the shorthand syntax: Pos, Len, Name, Count, Mark.
ja: プロパティが継承されている場合、__Getが呼び出されなくなったため、以下のサブパターン名は省略構文で使用できなくなりました：Pos、Len、Name、Count、Mark。

source: As a consequence of the above, semicolons never need to be escaped within a continuation section.
ja: 上記の結果、セミコロンを継続セクション内でエスケープする必要はない。

source: As a first example, note that MenuSelect fails to work with the menu bar on Outlook Express's "New Message" window.
ja: 最初の例として、MenuSelectがOutlook Expressの「New Message」ウィンドウのメニューバーで動作しないことに注意してください。

source: As a general rule, "AStr" should not be used for an output parameter since the buffer is only large enough to hold the input string.
ja: バッファは入力文字列を保持するのに十分な大きさしかないため、原則として「AStr」を出力パラメータに使用するべきではありません。

source: As a hotkey (Alt::) it fires upon release unless it has the tilde prefix.
ja: ホットキー（Alt::）として、チルダ プレフィックスがない限り、リリース時に起動します。

source: As a hotkey (Control::) it fires upon release unless it has the tilde prefix.
ja: ホットキー（Control::）として、チルダ プレフィックスがない限り、リリース時に起動します。

source: As a hotkey (Shift::) it fires upon release unless it has the tilde prefix.
ja: チルダのプレフィックスがない限り、ホットキー（Shift::）としてはリリース時に起動します。

source: As a message check could occur at any time within the 15.6 millisecond window, any setting between 1 and 16 could permit two message checks within a single interval.
ja: メッセージチェックは15.6ミリ秒のウィンドウの中でいつでも発生する可能性があるので、1から16の間のどの設定でも、1つのインターバル内に2つのメッセージチェックを許可することができます。

source: As a result, Send will invert the case of the characters if CapsLock happens to be ON during the operation.
ja: その結果、Send関数は、操作中にCapsLockがONになった場合、文字の大文字と小文字を反転します。

source: As a result, subsequent statements are performed on release instead of press.
ja: そのため、以降の記述は、プレスではなくリリースで行っています。

source: As a side-effect, any interrupted threads beneath it will lie dormant.
ja: 副次的な効果として、その下にある中断されたスレッドは休眠状態になります。

source: As a side-effect, this also prevents the mouse hook from being required by hotstrings (though it will still be installed if the script requires it for other purposes, such as mouse hotkeys).
ja: 副次的な効果として、これはマウスフックがホットストリングによって要求されるのを防ぎます。ただし、スクリプトがマウスのホットキーなど他の目的でそれを必要とする場合は、まだインストールされます。

source: As a workaround, AutoHotkey sends an empty property instead of an error code when a non-existent or invalid variable is requested.
ja: 回避策として、AutoHotkeyでは、存在しない変数や無効な変数が要求された場合、エラーコードではなく、空のプロパティを送信します。

source: As above, but followed by a colon and integer, where 1 is the first device with a matching name.
ja: 上記と同様だが、コロンと整数が続き、1が一致する名前を持つ最初のデバイスとなる。

source: As above, but followed by a colon and integer, where 1 is the first occurrence of a component with that name.
ja: 上記と同様だが、その後にコロンと整数が続き、1がその名前を持つコンポーネントの最初の出現となる。

source: As above, but if Mode is "Return", execution of the current thread is permitted to continue.
ja: 上記と同様ですが、Modeが "Return"の場合、現在のスレッドの実行を継続することが許可されます。

source: As above, but the presence of Else also prevents an error from being thrown if the file or path is not found.
ja: 上記と同様ですが、Elseの存在により、ファイルやパスが見つからない場合にエラーが発生するのを防ぐこともできます。

source: As above, but with a dividing line between columns.
ja: 上記と同様ですが、列の間に仕切り線があります。

source: As above, except that it can accept a string (or variable containing a string), in which case Bytes defaults to the size of the string in bytes.
ja: ただし、文字列（または文字列を含む変数）を受け取ることができ、その場合、Bytesは文字列のサイズ（バイト）をデフォルトとします。

source: As all cases are enclosed in the same block, a label defined in one case can be the target of Goto from another case.
ja: すべてのケースは同じブロックで囲まれているため、あるケースで定義されたラベルは、別のケースからのGotoのターゲットになることができる。

source: As all text is converted (where necessary) to the native string format, characters which are invalid or don't exist in the native codepage are replaced with a placeholder:
ja: すべてのテキストは（必要に応じて）ネイティブの文字列形式に変換されるため、無効な文字やネイティブのコードページに存在しない文字はプレースホルダーに置き換えられます：

source: As an oversimplified example, the hotkey ^c::Send "^c" would produce an infinite loop of keystrokes.
ja: 単純化しすぎた例として、ホットキー^c::Send "^c"はキーストロークの無限ループを生成することになります。

source: As capital letters are produced by sending Shift, A produces a different effect in some programs than a.
ja: Shiftを送ると大文字が出るように、Aはプログラムによってはaとは違う効果が出ます。

source: As described in introduction, a function may optionally return a value to its caller.
ja: 序章で説明したように、関数はオプションで呼び出し元に値を返すことができます。

source: As directives and function, hotkey, hotstring and class definitions are skipped when encountered during execution, it is possible for startup code to be placed throughout each file.
ja: ディレクティブや関数、ホットキー、ホットストリング、クラス定義は、実行中に遭遇するとスキップされるため、起動コードを各ファイル全体に配置することが可能です。

source: As directives, labels, double-colon hotkey and hotstring tags, and declarations without assignments are processed when the script is loaded from file, they are not subject to control flow.
ja: ディレクティブ、ラベル、ダブルコロンホットキーとホットストリングタグ、および割り当てのない宣言は、スクリプトがファイルからロードされるときに処理されるので、制御フローの対象にはなりません。

source: As hinted above, a variable can be used to hold a false value simply by making it blank or assigning 0 to it.
ja: 上で示唆したように、変数に空白にするか0を代入するだけで、偽とすることができます。。

source: As in the code above, an exception is thrown if Expression or __Enum yields a value which cannot be called.
ja: 上記のコードと同様に、Expressionまたは__Enumが呼び出すことのできない値を生成した場合、例外がスローされます。

source: As is the default for all functions, this function is assume-local.
ja: すべての関数のデフォルトとして、この関数はassume-localです。

source: As it is an array, params.Length can be used to determine the number of parameters.
ja: 配列なので、params.Lengthでパラメータの数を決定することができます。

source: As items are added to a menu or modified, the name and other properties of each item are stored in the Menu object.
ja: メニューに項目が追加されたり、変更されたりすると、各項目の名前とその他のプロパティがMenuオブジェクトに保存されます。

source: As mentioned above, assigning to a property that hasn't already been defined will create a new property.
ja: 前述のように、まだ定義されていないプロパティに代入すると、新しいプロパティが作成されます。

source: As new language behaviour implies that match.name would return a function by default, the methods have been replaced or supplemented with properties:
ja: 新しい言語の動作では、match.nameはデフォルトで関数を返すことになるため、メソッドはプロパティに置き換えられ、または補完されました：

source: As noted above, lParam is the address of a notification structure derived from NMHDR.
ja: 前述の通り、lParamは NMHDRから派生した通知構造体のアドレスです。

source: As of v1.1.14, the tilde prefix affects how a key works when used as a modifier key in a custom combination.
ja: v1.1.14以降、チルダ接頭辞は、カスタムコンビネーションでモディファイアキーとして使用する際のキーの動作に影響します。

source: As shown by the examples above, any expensive (time-consuming) functions should generally be called on the right side of an AND or OR to enhance performance.
ja: 上記の例で示したように、一般的に高価な（時間のかかる）関数は、パフォーマンスを高めるためにANDまたはORの右辺で呼び出す必要があります。

source: As the "Prompt to Overwrite" option is supported only by the Save dialog, specifying that option without the "Prompt to Create" option also puts the "S" option into effect.
ja: 上書き保存を促す」オプションは保存ダイアログでのみサポートされているため、「作成を促す」オプションを指定せずにこのオプションを指定すると、「S」オプションも有効になります。

source: As the "Prompt to Overwrite" option is supported only by the Save dialog, specifying that option without the "Prompt to Create" option also puts the S option into effect.
ja: 上書き保存を促す」オプションは保存ダイアログでのみサポートされているため、「作成を促す」オプションを指定せずにこのオプションを指定すると、Sオプションも有効になります。

source: As the content of the return value register is arbitrary in such cases, an exception may or may not be thrown if ReturnType is omitted.
ja: このような場合、戻り値レジスタの内容は任意であるため、ReturnTypeを省略した場合は例外が発生する可能性がある。
